app/controllers/sessions_controller.rb

	def create
		@user = User.find_by(id: session[:current_user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]